install_anaconda3_on_centos7.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-03-29 Thu 22:48 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>在Centos7里安装Anaconda3</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">在Centos7里安装Anaconda3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5b5ea75">1. 下载安装文件</a></li>
<li><a href="#org6edcc98">2. 安装</a></li>
<li><a href="#org04aa6e6">3. 使用</a>
<ul>
<li><a href="#orgd17b0f1">3.1. 安装virtualenv</a>
<ul>
<li><a href="#orgf8bad3a">3.1.1. 可以玩玩ipython</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org613d5f8">4. 其他</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5b5ea75" class="outline-2">
<h2 id="org5b5ea75"><span class="section-number-2">1</span> 下载安装文件</h2>
<div class="outline-text-2" id="text-1">
<p>
运行如下命令从<a href="https://mirrors.tuna.tsinghua.edu.cn/anaconda/archive/">https://mirrors.tuna.tsinghua.edu.cn/anaconda/archive/</a>
下载最新的给linux用的版本到你的home目录（主目录）里：</p>

<div class="org-src-container">
<pre class="src src-shell">wget -P ~ https://mirrors.tuna.tsinghua.edu.cn/anaconda/archive/Anaconda3-5.1.0-Linux-$(uname -m).sh 
</pre>
</div>

<p>
我写这篇教程的时候，最新的Anaconda3版本是5.1.0。呃，也许需要看下Anaconda3最新的版本号是多少，比如如果是5.2.0，那么用5.2.0替换上面命令里的5.1.0。</p>
</div>
</div>

<div id="outline-container-org6edcc98" class="outline-2">
<h2 id="org6edcc98"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
下载完以后，不要用root帐号安装。用普通的用户，假设你把文件存在了~目录下，那么执行</p>

<div class="org-src-container">
<pre class="src src-shell">bash ~/Anaconda3-5.1.0-Linux-x86.sh
</pre>
</div>

<p>
如果是新手，就所有选项接受默认值。那么Anaconda3会被安装在~/anaconda3。</p>

<p>
接受license的时候，要输入yes哈。如果是中文shell环境，输入什么，我还不知道，看具体的提示吧。</p>
</div>
</div>

<div id="outline-container-org04aa6e6" class="outline-2">
<h2 id="org04aa6e6"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
<p>
在shell里，先要执行</p>

<div class="org-src-container">
<pre class="src src-shell">source ~/anaconda3/bin/activate
</pre>
</div>


<p>
来激活刚才装的Anaconda3环境。</p>

<p>
但是，这只是完成了python3的安装。也就是说，Anaconda3只是python3的一个发行版。为了隔离不同的python库的版本，得用上virtualenv，下面接着跟我做。</p>
</div>

<div id="outline-container-orgd17b0f1" class="outline-3">
<h3 id="orgd17b0f1"><span class="section-number-3">3.1</span> 安装virtualenv</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在刚才source了  ~/anaconda3/bin/activate 的shell里，执行</p>

<div class="org-src-container">
<pre class="src src-shell">conda install virtualenv
virtualenv -p python3.6 ~/virtualenv/python3.6
</pre>
</div>

<p>
中间不出错的话，就会看到python3.6的virtualenv（虚拟环境）搭建完毕。</p>

<p>
具体到某个功能开发和实现，只使用下列语句就行：</p>

<div class="org-src-container">
<pre class="src src-shell">source ~/virtualenv/python3.6/bin/activate
</pre>
</div>

<p>
你会看到类似下面的输出</p>
<div class="org-src-container">
<pre class="src src-shell">(python3.6)
</pre>
</div>
</div>

<div id="outline-container-orgf8bad3a" class="outline-4">
<h4 id="orgf8bad3a"><span class="section-number-4">3.1.1</span> 可以玩玩ipython</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
呃，就是个交互式的python shell，比直接运行python得到的shell好用一些。</p>

<p>
运行ipython
</p>

<div class="org-src-container">
<pre class="src src-shell">ipython
</pre>
</div>

<p>
会看到类似下面的输出：</p>

<div class="org-src-container">
<pre class="src src-shell">Python 3.6.3 |Anaconda, Inc.| (default, Oct 13 2017, 12:02:49)
Type <span style="color: #ffa500;">'copyright'</span>, <span style="color: #ffa500;">'credits'</span> or <span style="color: #ffa500;">'license'</span> for more information
IPython 6.2.1 -- An enhanced Interactive Python. Type <span style="color: #ffa500;">'?'</span> for help.

In [1]:
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org613d5f8" class="outline-2">
<h2 id="org613d5f8"><span class="section-number-2">4</span> 其他</h2>
<div class="outline-text-2" id="text-4">
<p>
推荐的做法是，具体到某个应用、目的、功能开发的时候，用virtualenv。而如果是一些重要的编程库，则推荐安装到anaconda里。比如要安装pandas
</p>

<pre class="example">
conda install pandas
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.0.90 (<a href="http://orgmode.org">Org</a> mode 9.1.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>